perf-tests/results_v3_20260421_095020/webflux/hey_customer_summary_50k.txt

Summary:
  Total:	4.8477 secs
  Slowest:	1.0303 secs
  Fastest:	0.0003 secs
  Average:	0.0460 secs
  Requests/sec:	10314.1208
  
  Total data:	58500000 bytes
  Size/request:	1170 bytes

Response time histogram:
  0.000 [1]	|
  0.103 [48039]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.206 [1353]	|■
  0.309 [105]	|
  0.412 [2]	|
  0.515 [0]	|
  0.618 [0]	|
  0.721 [0]	|
  0.824 [0]	|
  0.927 [146]	|
  1.030 [354]	|


Latency distribution:
  10%% in 0.0093 secs
  25%% in 0.0179 secs
  50%% in 0.0319 secs
  75%% in 0.0488 secs
  90%% in 0.0721 secs
  95%% in 0.0940 secs
  99%% in 0.9111 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0238 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0752 secs
  req write:	0.0003 secs, 0.0000 secs, 0.0892 secs
  resp wait:	0.0450 secs, 0.0002 secs, 1.0271 secs
  resp read:	0.0004 secs, 0.0000 secs, 0.0795 secs

Status code distribution:
  [200]	50000 responses