perf-tests/results_v3_20260421_095020/webflux/k6_multi.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/k6_multi_endpoint.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 05/50 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  01.0s/50.0s

running (0m02.0s), 10/50 VUs, 100 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  02.0s/50.0s

running (0m03.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
default   [   6% ] 15/50 VUs  03.0s/50.0s

running (0m04.0s), 20/50 VUs, 306 complete and 0 interrupted iterations
default   [   8% ] 20/50 VUs  04.0s/50.0s

running (0m05.0s), 25/50 VUs, 444 complete and 0 interrupted iterations
default   [  10% ] 25/50 VUs  05.0s/50.0s

running (0m06.0s), 30/50 VUs, 694 complete and 0 interrupted iterations
default   [  12% ] 30/50 VUs  06.0s/50.0s

running (0m07.0s), 35/50 VUs, 1012 complete and 0 interrupted iterations
default   [  14% ] 35/50 VUs  07.0s/50.0s

running (0m08.0s), 40/50 VUs, 1382 complete and 0 interrupted iterations
default   [  16% ] 40/50 VUs  08.0s/50.0s

running (0m09.0s), 45/50 VUs, 1768 complete and 0 interrupted iterations
default   [  18% ] 45/50 VUs  09.0s/50.0s

running (0m10.0s), 49/50 VUs, 2223 complete and 0 interrupted iterations
default   [  20% ] 49/50 VUs  10.0s/50.0s

running (0m11.0s), 50/50 VUs, 2331 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  11.0s/50.0s

running (0m12.0s), 50/50 VUs, 2781 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  12.0s/50.0s

running (0m13.0s), 50/50 VUs, 3281 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  13.0s/50.0s

running (0m14.0s), 50/50 VUs, 3731 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  14.0s/50.0s

running (0m15.0s), 50/50 VUs, 4231 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  15.0s/50.0s

running (0m16.0s), 50/50 VUs, 4731 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  16.0s/50.0s

running (0m17.0s), 50/50 VUs, 4931 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  17.0s/50.0s

running (0m18.0s), 50/50 VUs, 5281 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  18.0s/50.0s

running (0m19.0s), 50/50 VUs, 5731 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  19.0s/50.0s

running (0m20.0s), 50/50 VUs, 6231 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  20.0s/50.0s

running (0m21.0s), 50/50 VUs, 6704 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  21.0s/50.0s

running (0m22.0s), 50/50 VUs, 7181 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  22.0s/50.0s

running (0m23.0s), 50/50 VUs, 7631 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  23.0s/50.0s

running (0m24.0s), 50/50 VUs, 7731 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  24.0s/50.0s

running (0m25.0s), 50/50 VUs, 8181 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  25.0s/50.0s

running (0m26.0s), 50/50 VUs, 8681 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  26.0s/50.0s

running (0m27.0s), 50/50 VUs, 9131 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  27.0s/50.0s

running (0m28.0s), 50/50 VUs, 9631 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  28.0s/50.0s

running (0m29.0s), 50/50 VUs, 10081 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  29.0s/50.0s

running (0m30.0s), 50/50 VUs, 10331 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  30.0s/50.0s

running (0m31.0s), 50/50 VUs, 10631 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  31.0s/50.0s

running (0m32.0s), 50/50 VUs, 11081 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  32.0s/50.0s

running (0m33.0s), 50/50 VUs, 11581 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  33.0s/50.0s

running (0m34.0s), 50/50 VUs, 12031 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  34.0s/50.0s

running (0m35.0s), 50/50 VUs, 12531 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  35.0s/50.0s

running (0m36.0s), 50/50 VUs, 13031 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  36.0s/50.0s

running (0m37.0s), 50/50 VUs, 13131 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  37.0s/50.0s

running (0m38.0s), 50/50 VUs, 13581 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  38.0s/50.0s

running (0m39.0s), 50/50 VUs, 14081 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  39.0s/50.0s

running (0m40.0s), 50/50 VUs, 14531 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  40.0s/50.0s

running (0m41.0s), 46/50 VUs, 15015 complete and 0 interrupted iterations
default   [  82% ] 46/50 VUs  41.0s/50.0s

running (0m42.0s), 41/50 VUs, 15445 complete and 0 interrupted iterations
default   [  84% ] 41/50 VUs  42.0s/50.0s

running (0m43.0s), 37/50 VUs, 15686 complete and 0 interrupted iterations
default   [  86% ] 37/50 VUs  43.0s/50.0s

running (0m44.0s), 31/50 VUs, 15851 complete and 0 interrupted iterations
default   [  88% ] 31/50 VUs  44.0s/50.0s

running (0m45.0s), 26/50 VUs, 16107 complete and 0 interrupted iterations
default   [  90% ] 26/50 VUs  45.0s/50.0s

running (0m46.0s), 21/50 VUs, 16342 complete and 0 interrupted iterations
default   [  92% ] 21/50 VUs  46.0s/50.0s

running (0m47.0s), 16/50 VUs, 16508 complete and 0 interrupted iterations
default   [  94% ] 16/50 VUs  47.0s/50.0s

running (0m48.0s), 11/50 VUs, 16643 complete and 0 interrupted iterations
default   [  96% ] 11/50 VUs  48.0s/50.0s

running (0m49.0s), 06/50 VUs, 16718 complete and 0 interrupted iterations
default   [  98% ] 06/50 VUs  49.0s/50.0s

running (0m50.0s), 05/50 VUs, 16729 complete and 0 interrupted iterations
default   [ 100% ] 05/50 VUs  50.0s/50.0s

     ✓ status 200

     checks.........................: 100.00% 16734 out of 16734
     data_received..................: 18 MB   356 kB/s
     data_sent......................: 1.6 MB  31 kB/s
     http_req_blocked...............: avg=7.29µs   min=0s       med=3µs     max=2.76ms   p(90)=8µs      p(95)=11µs    
     http_req_connecting............: avg=1.32µs   min=0s       med=0s      max=776µs    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=19.4ms   min=277µs    med=2.85ms  max=929.44ms p(90)=8.41ms   p(95)=11.31ms 
       { expected_response:true }...: avg=19.4ms   min=277µs    med=2.85ms  max=929.44ms p(90)=8.41ms   p(95)=11.31ms 
     http_req_failed................: 0.00%   0 out of 16734
     http_req_receiving.............: avg=33.84µs  min=4µs      med=20µs    max=4.24ms   p(90)=55µs     p(95)=81µs    
     http_req_sending...............: avg=28.42µs  min=1µs      med=9µs     max=6.27ms   p(90)=38µs     p(95)=105µs   
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=19.33ms  min=265µs    med=2.8ms   max=929.42ms p(90)=8.31ms   p(95)=11.2ms  
     http_reqs......................: 16734   334.249587/s
     iteration_duration.............: avg=120.19ms min=100.35ms med=103.6ms max=1.02s    p(90)=109.61ms p(95)=112.71ms
     iterations.....................: 16734   334.249587/s
     vus............................: 5       min=5              max=50
     vus_max........................: 50      min=50             max=50


running (0m50.1s), 00/50 VUs, 16734 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  50s